reproPack/code/cases/bouncingSphere/CFD/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet      
    {
//        type            fixedValue;
//        value           uniform 100000;

        type            zeroGradient;
    }

    wall      
    {
//        type            fixedValue;
//        value           uniform 100000;
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }
}

// ************************************************************************* //
